{
  "Sword": "Deals direct physical damage to a single target within melee range. No special mechanics.",
  "Dash Attack": "Propels the caster forward in a burst of speed, dealing damage and knocking back enemies in the path. Physical, no mana cost.",
  "Heavy Strike": "Charges a powerful overhead blow over 1.2 seconds. Movement reduced to 30% during windup. Connects at extended hit radius of 4 units.",
  "Whirlwind": "Spins with weapon extended during a 0.8s windup, then hits all enemies within 5 units. Movement reduced to 20% during spin-up.",
  "Crushing Blow": "A 2-second windup delivers a devastating overhead strike. Stuns the target for 1 second. Movement reduced to 15% during charge.",
  "Fireball": "Launches a blazing projectile at 12 units/sec. Instant cast with no special on-hit effects.",
  "Ice Shard": "Hurls a fast ice shard at 15 units/sec. Applies a 30% movement speed reduction for 2 seconds on hit.",
  "Lightning Bolt": "Channels for 1.5 seconds, then fires a fast bolt at 25 units/sec. Must remain stationary during cast.",
  "Pyroblast": "Channels for 2.5 seconds to conjure a massive fireball. Applies burn DoT dealing damage over 4 ticks across 4 seconds. Must stand still.",
  "Arcane Missile": "Channels for 1.0 seconds, then fires a seeking missile at 18 units/sec. Must remain stationary during cast.",
  "Frost Nova": "Channels for 1.8 seconds then releases a burst of frost in an 8-unit radius. Freezes up to 8 enemies for 3 seconds. Self-centered AoE.",
  "Heal": "Instantly restores 20 health points to the caster. Self-cast healing ability with no cast time.",
  "Greater Heal": "Channels for 2.0 seconds to deliver a powerful heal of 50 health points. Must stand still during cast.",
  "Arcane Strike": "Melee attack infused with arcane energy. Deals higher base damage than physical strikes at moderate mana cost.",
  "Frost Strike": "Frost-enchanted melee attack. Reduces target movement speed by 40% for 3 seconds on hit.",
  "Shield Bash": "Strikes with shield at close range. Stuns the target for 1.5 seconds, interrupting their current action.",
  "Charge": "Rushes toward the enemy at increased speed. Deals damage and applies heavy knockback (force 5) on impact.",
  "Taunt": "Forces up to 3 enemies within 6 units to focus their attacks on the caster for 4 seconds.",
  "Fortify": "Raises a defensive shield that absorbs up to 50 damage over 5 seconds. Self-buff.",
  "Frost Bolt": "Icy projectile that applies a 50% movement speed slow for 3 seconds on hit. Moderate damage.",
  "Blizzard": "Channels an ice storm for 4 seconds. Deals damage in 8 ticks across a 5-unit area. Slows targets briefly per tick.",
  "Chain Lightning": "Lightning projectile at 30 units/sec that bounces between up to 4 targets. Reduced damage per bounce.",
  "Meteor": "2-second cast calls down a massive meteor dealing heavy fire damage in a 4-unit radius. Applies burn DoT for 3 seconds.",
  "Arcane Shield": "Creates a magical barrier absorbing up to 40 damage. Lasts 8 seconds or until the shield is depleted.",
  "Teleport": "Instantly blinks the caster up to 10 units in their facing direction. No damage, pure mobility.",
  "Backstab": "High-damage melee strike optimized for attacking from behind. Pure physical burst damage.",
  "Poison Blade": "Coats weapon in poison on hit. Deals initial damage plus poison DoT over 6 ticks across 6 seconds.",
  "Smoke Bomb": "Deploys a 4-unit radius smoke cloud at range. Blinds all enemies inside for 3 seconds, reducing accuracy.",
  "Fan of Knives": "Throws daggers in all directions, hitting up to 8 enemies within 6 units. Instant AoE burst.",
  "Shadow Step": "Teleports directly behind the targeted enemy from up to 40 units away. Repositioning tool, no damage.",
  "Holy Light": "1.5-second cast heal. Restores 35 health to a single target. Requires standing still.",
  "Rejuvenation": "Applies a heal-over-time effect restoring 40 total health over 8 ticks across 8 seconds.",
  "Circle of Healing": "Heals up to 5 allies within an 8-unit radius for 20 health each. Instant cast AoE heal.",
  "Blessing of Strength": "Increases target ally's damage output by 25% for 15 seconds. Single-target buff.",
  "Purify": "Instantly removes all harmful debuffs from the target ally. No cast time, no damage.",
  "Entangling Roots": "Roots the target in place for 4 seconds. Target can still attack but cannot move. Deals minor initial damage.",
  "Thorns": "Applies a reflect aura for 20 seconds. Melee attackers take 5 damage per hit against the buffed target.",
  "Nature's Wrath": "Unleashes nature energy in a 5-unit radius, damaging all enemies in the area. Instant AoE burst.",
  "Life Drain": "Channels for 3 seconds, dealing damage in 6 ticks while simultaneously healing the caster for 4 health per tick.",
  "Curse of Weakness": "Reduces the target's damage output by 25% for 10 seconds. Single-target debuff.",
  "Fear": "Terrifies the target, stunning them in place for 4 seconds. Interrupts all actions and casts.",
  "Summon Skeleton": "Raises a skeleton warrior that fights alongside the caster for 30 seconds. Summoned unit has its own AI.",
  "Ice Lance": "Piercing ice projectile at 18 units/sec that passes through enemies, hitting up to 3 targets in a line.",
  "Flame Wave": "Sends a wave of fire along a line, dealing damage in a 2-unit-wide path. Applies burn DoT for 2 seconds.",
  "Earthquake": "1-second cast, then channels for 3 seconds. Shakes ground in 8-unit radius dealing 6 ticks of damage with brief 0.5s stun per tick.",
  "Sprint": "Increases caster movement speed by 50% for 8 seconds. Self-buff with no combat effects.",
  "Battle Shout": "AoE buff increasing damage output by 15% for up to 5 allies within 10 units. Lasts 20 seconds.",
  "Dark Strike": "Monster melee attack with a giant shadow sword. Direct physical damage at close range.",
  "Shadow Bolt": "Monster ranged projectile of dark energy at 6 units/sec. Direct damage, slower but harder-hitting than player projectiles.",
  "Dark Heal": "Monster channels dark energy to instantly restore 25 health. Self-cast heal.",
  "Ally Sword": "Basic ally melee attack dealing direct physical damage at close range.",
  "Ally Fireball": "Ally ranged projectile at 8 units/sec. Direct fire damage at range.",
  "Ally Heal": "Ally self-healing ability restoring 15 health instantly."
}
